turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
/*
 * TW_ESP8266v4.c
 *
 *  Created on: Aug 19, 2022
 *      Author: Turjasu Pyne
 *      Addition: This version has the TCP Client functioanlity setups
 *
 *      Uses USCI A0
 */

#include "GenericUART/TW_GenericUART_UCAx.h"
#include <msp430.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include <stdbool.h>
#include <string.h>
#include <ESPv4/TW_ESP8266_v4.h>
// Project specific includes//
//#include "BranonSpecific/BranonSpecific_v4.h"
//#include "BranonSpecific/HomeScreen.h"

/*
 *  Variables
 */

                                  unsigned char           _MdmBuffer[1024],
                                                          _MdmStatus[80],        // Global MBuffer to store the modem replies. Define in your required C/CPP files/classes
                                                          _MdmHTTPBuff[1024],
                                                          _MdmIPAddr[16] = {NULL};
                                  unsigned char           _APpassword[30]="TM#4C1294NCPDTI3",
                                                          _APname[30]="TurjasuzWorldAP8";//INTIALIZED VALUE, CHECK FOR THIS
volatile      static              int                     _MdmBuffCnt = 0;
                                  char                    *temp_mdm = NULL;

              long long int                              _bytesDataTransacted=0;
              int                                        _wifiConnFailureTimes=0;

/*
* SET & GET API DECLARATIONS : : CHANGES ACCORDING TO THE PROJECT !!!
*/
const  char              _MdmGET_API_url[] = "GET http://www.turjasuzworld.online/api/srv2.php?dvid=D1257 HTTP/1.1\r\nHost: Turjasu\r\nConnection: close\r\n\r\n";
const  char              _MdmGETurl[] = "GET http://www.turjasuzworld.in/demo/api/getdevicewifi.php?did=TD1004 HTTP/1.1\r\nHost: Turjasu\r\nConnection: close\r\n\r\n";
char              _MdmSETurl[] = "GET http://www.turjasuzworld.in/demo/api/setdevicetemp.php?did=TD1004-1&temp=999.99&day=19&mon=07&year=2020&hh=15&mm=52&ss=47&signal=45 HTTP/1.1\r\nHost: Turjasu\r\nConnection: close\r\n\r\n";;
char              _MdmConstructedSetUrl[];
const  char              _MdmSET_DebugUrl[] = "";
const  char              _amp[]="&";
const  char              _MdmSETurl_URI[] = "GET http://www.turjasuzworld.online/api/srv.php?";
const  char              _MdmSETurl_DVID[] = "did=TD1004-1";//D1257&

const  char              _MdmSETurl_HTTP_CONSTRUCT[] = " HTTP/1.1\r\nHost: Turjasu\r\nConnection: close\r\n\r\n";
const  char              _serverURL[] = "turjasuzworld.in";



struct      _wifiParams     WifiParams;


/*
 * Wrapper to set the ssid and password
 * Max. no of characters = 30
 */
int                setWifiCred(char* ssid, char* password)
{
    static int idx = 0;
    if((strlen(ssid) > 30)||(strlen(password) > 30)) return -1;

    if((*ssid != NULL)&&(*password != NULL))
    {
        for (idx = 0; idx < 30; idx++)
        {
            WifiParams._wifiSSID[idx] = *ssid;
            ssid++;
        }

        for (idx = 0; idx < 30; idx++)
        {
            WifiParams._wifiPSWD[idx] = *password;
            password++;
        }


    }
    else    return -2;

    return 0;
}





/* Configure the ports ONLY FOR THE USCIA0
 * P3.4 = USCIA0TXD
 * P3.5 = USCIA0RXD
 * IF THE BOARD USES OTHER USCIAx MODULE, PLEASE MODIFY THE
 * INSTRUCTIONS ACCORDINGLY
 *
 * TW PRODUCTS WILL ALWAYS USE USCIA0 = P3.4 & 3.5 FOR MODEM
 * COMMUNICATIONS
 *
 */
esp8266StateMachines ESP_PinSetup(void)
{
    esp8266StateMachines esp8266StateMachines;
    _ESP_PORT_DIR |= _ESP_RST;
    _ESP_PORT_OUT &= ~_ESP_RST; // keep ESP in Reset state
    esp8266StateMachines = _E8266_PWR_UP;
    return esp8266StateMachines;
}

/*
 * Turn the modem on/off control
 * mode = 1 = turn on immediately
 * mode = 2 = turn on after 1 second delay
 * mode = 3 = turn off
 * mode = 4 = restart (requires 2 second delay)
 *
 * returns a 0 if everything is done properly
 */

esp8266StateMachines ESP_ON_OFF(uint8_t mode)
{
        esp8266StateMachines status = _UNKNOWN;
        if (_E8266_PWR_UP == ESP_PinSetup()) // Configures the switch on/off pins accordingly
        {
            switch (mode)
            {
                case 1:// TURN ON IMMEDIATELY
                    _ESP_RST_PORT_OUT |=  _ESP_RST;
                    status = _E8266_PWR_UP;
                    break;
                case 2:// TURN ON AFTER 1 SEC DELAY
                    _delay_cycles(SystemFreq);  // 1 sec delay
                    _ESP_RST_PORT_OUT |=  _ESP_RST;
                    status = _E8266_PWR_UP;
                    break;
                case 3:// TURN OFF IMMEDIATELY
                    _ESP_RST_PORT_OUT &= ~ _ESP_RST;
                    status = _E8266_PWR_DN;
                    break;
                case 4:// RESTART
                    _ESP_RST_PORT_OUT &= ~ _ESP_RST;
                    _delay_cycles(SystemFreq); // this will be timer based later
                    _ESP_RST_PORT_OUT |=   _ESP_RST;
                    _delay_cycles(SystemFreq*2); // this will be timer based later
                    status = _E8266_RST_SUCCESS;
                    break;
                default:
                    status = _FAIL;
                    break;
            }
        }
        else
        {
                // no handling for unknown state
        }



        return  status;
}

///*
// *  Functions to control ESP8266
// */
//esp8266StateMachines resetESP8266(void)
//{
//    P9OUT   |=  ESP_RST;
//    _delay_cycles(SystemFreq);
//    P9OUT   &= ~ESP_RST;
//    _delay_cycles(SystemFreq/2);
//    return _E8266_RESET_DONE;
//}

esp8266StateMachines moduleInitDiag(esp8266StateMachines currState)
{
    esp8266StateMachines state = currState;

    return state;

}

/*
 * baudrate will be 9600 to any suitable value.
 * Oversampling is off. please read datasheet before pushing values
 */
uint8_t ConfigureEspUART(float baudrate, uint8_t interrupt_polling)
{
    volatile float    val, val3;
    uint16_t  val2;
    volatile int val4 = 0;
     _ESP_PORT_SEL |= (_ESP_UART_RX + _ESP_UART_TX);                             // P3.4,5 = USCI_A2 TXD/RXD
     UCA2CTL1 |= UCSWRST;                      // **Put state machine in reset**
     UCA2CTL1 |= UCSSEL_2;                     // SMCLK
     // Calculation of the baudrate values
     val = (SystemFreq/baudrate);
     val2 = (uint16_t)(val);
     if(val2 < 16)
     {

                 UCA2BR0 = val2 % 256;                              // (see User's Guide)
                 UCA2BR1 = val2 / 256;                              //
                 UCA2MCTL |= UCBRS_7;
                 val3 = (val - val2)*8;
                 val4 = (int)(val3);
                 switch (val4)
                 {
                    case 0:
                        UCA2MCTL |= UCBRS_0 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 1:
                        UCA2MCTL |= UCBRS_1 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 2:
                        UCA2MCTL |= UCBRS_2 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 3:
                        UCA2MCTL |= UCBRS_3 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 4:
                        UCA2MCTL |= UCBRS_4 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 5:
                        UCA2MCTL |= UCBRS_5 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 6:
                        UCA2MCTL |= UCBRS_6 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    case 7:
                        UCA2MCTL |= UCBRS_7 + UCBRF_0;            // Modulation UCBRSx=1, UCBRFx=0
                        break;
                    default:
                        break;
                }
     }
     else
     {
         UCA2MCTL |= UCOS16;
         UCA2BR0 = ((uint16_t)(val/16))%256;
         UCA2BR1 = ((uint16_t)(val/16))/256;
         val3 = (val/16 - (uint16_t)(val/16))*16;
         val4 = (uint16_t)(val3);

         switch (val4)
         {
            case 1:
                UCA2MCTL |= UCBRF_1;
                break;
            case 2:
                UCA2MCTL |= UCBRF_2;
                break;
            case 3:
                UCA2MCTL |= UCBRF_3;
                break;
            case 4:
                UCA2MCTL |= UCBRF_4;
                break;
            case 5:
                UCA2MCTL |= UCBRF_5;
                break;
            case 6:
                UCA2MCTL |= UCBRF_6;
                break;
            case 7:
                UCA2MCTL |= UCBRF_7;
                break;
            case 8:
                UCA2MCTL |= UCBRF_8;
                break;
            case 9:
                UCA2MCTL |= UCBRF_9;
                break;
            case 10:
                UCA2MCTL |= UCBRF_10;
                break;
            case 11:
                UCA2MCTL |= UCBRF_11;
                break;
            case 12:
                UCA2MCTL |= UCBRF_12;
                break;
            case 13:
                UCA2MCTL |= UCBRF_13;
                break;
            case 14:
                UCA2MCTL |= UCBRF_14;
                break;
            case 15:
                UCA2MCTL |= UCBRF_15;
                break;
            default:
                break;
        }


