turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
     }


     UCA2CTL1 &= ~UCSWRST;                     // **Initialize USCI state machine**
     switch (interrupt_polling)
     {
        case 1:
            UCA2IE |= UCRXIE;                         // Enable USCI_A2 RX interrupt
            __bis_SR_register(GIE);       // Enter LPM0, interrupts enabled
            break;
        case 2:
             UCA2IE &= ~(UCRXIE + UCTXIE);                         // Enable USCI_A2 RX interrupt
             break;
        default:
            break;
    }

     return 0;
}


/*
 *  Reset the buffer counter
 */
void    ClrEspBuff(void)
{
    if(_MdmBuffCnt>0)
        {
            unsigned int var;
            for (var = 0; var < _MdmBuffCnt; ++var)
            {
                _MdmBuffer[var]='\0';
            }
            _MdmBuffCnt = 0;
        }
}


/*
 *  Send String of data to modem by calling this Fn.
 */
void     SendDataToESP(const char* data)
{
//    uint8_t indx=0;

        ClrEspBuff();
        while(*data)
        {
            while (!(UCA2IFG&UCTXIFG));             // USCI_A2 TX buffer ready?
            UCA2TXBUF = *data;                  // TX -> RXed character
                SendCharToUCA3(*data);
            data++;
        }



}

/*
 *  Send single character data to modem
 */
void      SendCharToESP(unsigned char data)
{
        while (!(UCA2IFG&UCTXIFG));             // USCI_A2 TX buffer ready?
        UCA2TXBUF = data;                  // TX -> RXed character
            SendCharToUCA3(data);
        _delay_cycles(SystemFreq/100);

}

/*
 *  Disable the Long Response and Echo,
 *  Condition is saved in _MdmInitSts
 */
void    DeEchoShrtRsp(void)
{

}


/*
 *  Initializes the Modem and checks the status of init. Also
 *  Checks for the diagnostics and saves required values
 *  to an Array through a return Pointer to an Array
 *  OutPut Array Format = {
 *  ICCID[20] //+CCID: “898600220909A0206023898600220909A0206023”
 *  COPS[] //+COPS: 0,0,"Vodafone - Delhi"
 *  QINISTAT[1] //+QINISTAT: 3
 *  QLTS[]      //+QLTS: "19/07/06,17:26:27+22,0" --> ONLY ONCE ALLOWED IMMEDIATELY AFTER POWER UP & NEEDS AT+CTZU=3
 *  CREG[]      //+CREG: 0,5
 *  CSQ[]       //+CSQ: 31,0
 *  CBC[]       //+CBC: 0,82,3955
 *
 *  _MdmStatus[0-19:ICCID][20-22:0,2/0,5 CREG][OPERATER]
 *
 *  ///////////////////////
 *  STATE MACHINES
 *  //////////////////////
 *   POWER ON -> UNECHO SHRT RESPNSE -> SET NTWRK TIME SYNC -> CHK NTWRK REG -> CHECK NTWRK PWR -> CHK MODULE SUPPLY VOLTAGE-->EXIT
 *   /////////////////////
 *   example:
 *   _MdmStatus[70]=[iccid 0-19][;][netwrg status 20-22][;][operator name 23-?][;][RSSI ? +2][;][network time GMT + time zone ?+21][;][cbc mode ? +7][;]
 *   _MdmStatus[70]=[12231092012343127901][;][0,5][;][Vodafone - Delhi][;][31][;][19/07/13,08:09:53,+22][;][,03,3960]
 */

esp8266StateMachines    _ReadEspRSSI(char* apName, char* rssiHolder)
{
    esp8266StateMachines RetSts;
    static char* res= NULL;
    ///////////// Network Strength Fetch ////////////
    static int RetryTimeout = 2;
    do
    {
        SendDataToESP("AT+CWLAP\r\n");

        __delay_cycles(SystemFreq);
        res = NULL;

        res = mdmReplySearch((const char *)_MdmBuffer, (const char *)apName); // Checking for the OK will skip or loose the RSSI details which is sent slowly from ESP01
        if(res == NULL)
        {
            return _E8266_RSSI_RCV_TIMEOUT;
        }

        else
        {
            RetSts = _E8266_RSSI_RCV_SUCCESS;
        }

        RetryTimeout--;

    } while((RetSts != _E8266_RSSI_RCV_SUCCESS)&&(RetryTimeout>0));

    if(RetSts == _E8266_RSSI_RCV_SUCCESS)
    {
        temp_mdm = strstr((const char*)_MdmBuffer, (const char*)apName);
        temp_mdm+= strlen((const char*)apName);
        temp_mdm += 2;
        rssiHolder[0] = 0; // completely clear previous values to null
        rssiHolder[1] = 0;
        rssiHolder[2] = 0;
        int Charcount= 0; // DONT USE THIS BECAUSE WE DON'T\KNOW HOW MANY CHARS WILL COOME IN COPS
        while(*temp_mdm != ',')
        {

            rssiHolder[Charcount]= *temp_mdm;
            temp_mdm++;
            Charcount++;
        }

    }

    return RetSts;
}


/*
 *  Get the IP Address of the instance
 */

int            ReadIPAddr(void)
{
    // useless Fxn
    return 0;
}

/*
 *  Disable the ESP8266 Module
 */
void            disESP8266(void)
{
    _ESP_EN_PORT_OUT &= ~_ESP_EN;
}

/*
 *  Enable the ESP8266 Module
 */
void            enESP8266(void)
{
    _ESP_EN_PORT_OUT |= _ESP_EN;
}



esp8266StateMachines    MdmMakeReady(espOperCommand OperCmd, esp8266StateMachines currState, char* _getUrlPtr, char* _servUrlPtr, char* _udpServUrlPtr,char* _setUrlPtr,int _udpServPort, int _udpDataLen) // currState will be verified everytime
{
    /*                  === GET EXAMPLE =====
     *

     */
    volatile                     esp8266StateMachines RetSts =  currState; //_E8266_PWR_UP;
    static volatile int          RetryTimeout1=0, RetryTimeout2=0,RetryTimeout3=0,RetryTimeout4=0,RetryTimeout5=0;
    volatile int Charcount=0, res_type = 0;
    static int  temp_count=0, waitCount = 0;
    volatile char* res = NULL;
    static  unsigned int   ctr=0, udpDataCtr = 0;
///////////// Initialization Switch Cases////////////////////
    switch (OperCmd)
    {
            case _Esp_Full_Init:
                SendDataToUCA3("__case _Esp_Full_Init in MdmMakeReady__\r");
                _ESP_EN_PORT_DIR |= _ESP_EN;
                _ESP_RST_PORT_DIR |= _ESP_RST;

                if((RetSts == _E8266_PWR_UP)||(RetSts == _E8266_PWR_RESTART))
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    _delay_cycles(SystemFreq);
                    _ESP_RST_PORT_OUT |= _ESP_RST;
                    _delay_cycles(SystemFreq*5);

                    SendDataToESP("AT\r\n");
                    _delay_cycles(SystemFreq*3);
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")==NULL) RetSts = _E8266_PWR_UP_FAILURE;
                    else RetSts = _E8266_PWR_UP_SUCCESS;
                }
                else if(RetSts == _E8266_PWR_DN)
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    SendDataToESP("AT\r\n");
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")==NULL) RetSts = _E8266_PWR_OFF;
                    else RetSts = _E8266_UNKNOWN_FAILURE;
                }
                else if(RetSts == _E8266_PWR_RESTART_DELAY)
                {
                    _ESP_RST_PORT_OUT &= ~_ESP_RST;
                    _delay_cycles(SystemFreq*5);
                    _ESP_RST_PORT_OUT |= _ESP_RST;
                    _delay_cycles(SystemFreq*5);

                    SendDataToESP("AT\r\n");
                    if (mdmReplySearch((const char*)_MdmBuffer, "OK")==NULL) RetSts = _E8266_PWR_UP_FAILURE;
                    else RetSts = _E8266_PWR_UP_SUCCESS;
                }
                else
                {

