turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
                }

                break;


        case _Esp_Connect_WIFI:
             RetSts = currState;
             if((RetSts == _E8266_PWR_UP_SUCCESS)||(RetSts == _E8266_RST_SUCCESS)||(RetSts == _E8266_DeECHO_SUCCESS))
             {
                 ///////////// send CWMODE = 1  _E8266_STN_MODE_FAIL /  _E8266_STN_MODE_SUCCESS, ////////////
                 RetryTimeout1 = 5;
                 do
                 {

                     SendDataToESP("AT+CWMODE=3\r\n"); // station mode set :: AT+CWMODE=3 for new ESP, AT+CWMODE_CUR=3 for old ESPs
                     //_delay_cycles(SystemFreq*3);
/*
                     res = NULL;
                     do
                     {
                         res = mdmReplySearch((const char *)_MdmBuffer, "OK");
                         res = mdmReplySearch((const char *)_MdmBuffer, "FAIL");
//                         res = strstr((const char *)_MdmBuffer,"AT+CWMODE_CUR=1"); //===> error detected here. cannot compare like this as the
                                                                                     //buffer is filled with other value that remoes the condition of res==NULL
                         _delay_cycles(SystemFreq/5);

                     } while (res == NULL); // Blocking Call
*/
                     RetryTimeout2 = 30;
                     do
                     {
                         _delay_cycles(SystemFreq/5);
                         res = NULL;
                         res = strstr((const char *)_MdmBuffer,"FAIL");
                         _delay_cycles(SystemFreq/5);
                         if(*res == 'F')
                         {

                             break;
                         }
                         res = strstr((const char *)_MdmBuffer,"OK");
                         _delay_cycles(SystemFreq/5);
                         if(*res == 'O')
                         {

                             break;
                         }
                         RetryTimeout2--;
                     } while ((res == NULL)&&(RetryTimeout2>0));

                     if(*res=='O')
                     {
                         res_type = 0; // 0 = success
                         // SET HOSTNAME //
                          SendDataToESP("AT+CWHOSTNAME=\"ESP_F7E8AE\"\r\n");
                          __delay_cycles(SystemFreq*3);
                         RetSts = _E8266_STN_MODE_SUCCESS;
                     }
                     else if(*res=='F')
                     {
                         res_type = -1; // -1 = fail
                         RetSts = _E8266_STN_MODE_FAIL;
                     }

                     RetryTimeout1--;

                 } while((RetSts != _E8266_STN_MODE_SUCCESS)&&(RetryTimeout1>0));

                 if (RetryTimeout1 == 0)
                  {
                     RetSts = _E8266_STN_MODE_FAIL;
                  }



                 /////////// Next connect to WIFI Network (this should be fetched from LCD///////////
                 if(RetSts == _E8266_STN_MODE_SUCCESS)
                              {

                                  RetryTimeout1 = 3;
                                  do
                                  {
                                      SendDataToESP("AT+CWJAP=\"");//:: AT+CWJAP for new ESP, AT+CWJAP_CUR for old ESPs
                                      SendDataToESP((const char*)WifiParams._wifiSSID);
                                      SendDataToESP("\",\"");
                                      SendDataToESP((const char*)WifiParams._wifiPSWD);
                                      SendDataToESP("\"\r\n"); // later ssid and psswd will be fetched from LCD
                                      _delay_cycles(SystemFreq*10);
                                      RetryTimeout5 = 20;
                                      do
                                      {
                                          //res = strstr((const char *)_MdmBuffer,"OK");
                                          __delay_cycles(SystemFreq);
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"OK");
                                          if(*res == 'O')
                                          {
                                              break;
                                          }
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"FAIL");
                                          if(*res == 'F')
                                          {
                                              break;
                                          }
                                          RetryTimeout5 --;
                                      } while (RetryTimeout5>0); // no more Blocking Call
                                      if(res!=NULL)
                                      {
                                          if((*res)=='F')
                                          {
                                              res = NULL;
                                              res = strstr((const char *)_MdmBuffer,"CWJAP:");
                                              res = res + 6;// point to <error code> in +CWJAP_CUR:<error code>
                                              if(*res == '1')
                                                  {
                                                      RetSts = _E8266_CWJAP_CON_TIMOUT_1;
                                                  }
                                              else if(*res == '2')
                                                  {
                                                      RetSts = _E8266_CWJAP_WRNG_PSWRD_2;
                                                  }
                                              else if(*res == '3')
                                                  {
                                                      RetSts = _E8266_CWJAP_AP_NT_FND_3;
                                                  }
                                              else if(*res == '4')
                                                  {
                                                      RetSts = _E8266_CWJAP_CON_GENERAL_FAIL_4;
                                                  }
                                              else
                                                  {
                                                      RetSts = _E8266_CWJAP_UNKNWN_FAIL;
                                                  }

