turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
                                          }
                                          else if((*res)=='O')
                                          {
                                              RetSts = _E8266_WIFI_CONCTD_SUCCESS;
//                                              res = NULL;
//                                              do //NO MORE SUPPORTED IN NEW ESP01s
//                                              {
//                                                  res = strstr((const char *)_MdmBuffer,"WIFI GOT IP");
//                                              } while (res == NULL); // Blocking Call

                                              if(res!=NULL)
                                              {
                                                  RetSts = _E8266_WIFI_RCV_IP_SUCCESS;
                                              }
                                          }

                                      }
                                      else
                                      {
                                          // no handling reqd.
                                      }



                                      RetryTimeout1--;

                                  } while((RetSts != _E8266_WIFI_RCV_IP_SUCCESS)&&(RetryTimeout1>0));

                                  if (RetryTimeout1 == 0)
                                   {
                                      //return the RetSts received

                                   }
                              }

                 ////////////Ping and check Internet availability ////////////////////////////
                 if(RetSts == _E8266_WIFI_RCV_IP_SUCCESS)
                 {
                     RetryTimeout1 = 2;
                     do
                     {
                         SendDataToESP("AT+CIFSR\r\n");

                         res = NULL;
                         res = mdmReplySearch((const char *)_MdmBuffer, "\""); //+CIFSR:STAIP,"192.168.1.7"<\r><\n>

                         res += 1; // points to the first number of the IP
                         temp_count = 0;
                         while(*res != '"')
                         {

                             WifiParams._wifiIPAddr[temp_count] = *res;
                             //_MdmIPAddr[temp_count] = *res;
                             temp_count++;
                             res++;
                         }
                         _delay_cycles(SystemFreq/5);

                         waitCount = 5;
                         SendDataToESP("AT+PING=\"www.turjasuzworld.in\"\r\n");
                         _delay_cycles(SystemFreq*5);

                         do
                         {
                             res = NULL;
                             res = strstr((const char *)_MdmBuffer,"OK");
                             _delay_cycles(SystemFreq/2);
                             if(*res == 'O')
                             {
                                 break;
                             }
                             res = NULL;
                             res = strstr((const char *)_MdmBuffer,"ERROR");
                             _delay_cycles(SystemFreq/2);
                             if(*res == 'E')
                             {
                                 break;
                             }
                             waitCount --;
                         } while ((res == NULL)&&(waitCount>0)); // Blocking Call but implemented timeout
                         if(*res == 'O')
                         {
                                 ctr = 0;
                             while(*res != '+') res--;      // search for the previous + sign
                             res++;
                             while((*res != '\r')&&(ctr<sizeof(WifiParams._wifiInetPingMs)))
                             {
                                 WifiParams._wifiInetPingMs[ctr]=*res;
                                 ctr++;
                                 res++;
                             }
                             RetSts = _E8266_PING_SUCCESS;
                         }
                         else if(*res == 'E')
                         {
                             WifiParams._wifiInetPingMs[0]='n';
                             WifiParams._wifiInetPingMs[1]='o';
                             WifiParams._wifiInetPingMs[2]='I';
                             WifiParams._wifiInetPingMs[3]='N';
                             RetSts = _E8266_PING_FAIL;
                         }
                         RetryTimeout1--;
                     } while((RetSts != _E8266_PING_SUCCESS)&&(RetSts != _E8266_PING_FAIL)&&(RetryTimeout1>0));

                     if (RetryTimeout1 == 0)
                     {
                         RetSts = _E8266_PING_TIMEOUT;
                     }
                 }

             }
             else
             {
                 // No handling reqd. the last status will be returned
             }


            break;



        case _Esp_disConnect_WIFI:
            // use case not needed
            break;

        case _Esp_CreateandConnect_TCP_Client:

            RetryTimeout1 = 5;
            do {
                if(_servUrlPtr == NULL){
                    RetSts =  _E8266_CIPSTART_SRVR_PTR_NULL;
                    break;
                }
                SendDataToUCA3("__case _Esp_Create_TCP_Client in MdmMakeReady__ Retry:");
                SendCharToUCA3(RetryTimeout1 + 48);
                // Connect to TCP Server
                SendDataToESP("AT+CIPSTART=\"TCP\",\"");
                SendDataToESP(_servUrlPtr);
                SendDataToESP("\",");
                if (_udpServPort < _TCP_PORT_MAX){
                    if((_udpServPort/10000)>0){
                        SendCharToESP((_udpServPort/10000)+48);
                        SendCharToESP(((_udpServPort%10000)/1000)+48);
                        SendCharToESP(((_udpServPort%1000)/100)+48);
                        SendCharToESP(((_udpServPort%100)/10)+48);
                        SendCharToESP((_udpServPort%10)+48);
                    }
                    else if ((_udpServPort/1000)>0){
                        SendCharToESP((_udpServPort/1000)+48);
                        SendCharToESP(((_udpServPort%1000)/100)+48);
                        SendCharToESP(((_udpServPort%100)/10)+48);
                        SendCharToESP((_udpServPort%10)+48);
                    }
                    else if ((_udpServPort/100)>0){
                        SendCharToESP((_udpServPort/100)+48);
                        SendCharToESP(((_udpServPort%100)/10)+48);
                        SendCharToESP((_udpServPort%10)+48);
                    }
                    else{
                        SendCharToESP((_udpServPort/10)+48);
                        SendCharToESP((_udpServPort%10)+48);
                    }
                }
                else{
                    SendDataToUCA3("TCP Port value Out of Bound > 65536");
                    RetSts = _E8266_TCP_PORT_VAL_INVALID;
                }
                SendDataToESP("\r\n");
                _delay_cycles(SystemFreq*3);// ==> remove this later
                // Wait till modem output is silent !/////////
                RetryTimeout5 = 0;
                do
                {
                    RetryTimeout5++;
                    _delay_cycles(SystemFreq*2);//Adjust this as per network latency

