turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
                } while((_MdmBuffCnt == 0)&&(RetryTimeout5 < 3));
                if(RetryTimeout5 == 3)
                {
                    RetSts =  _E8266_CIPSTART_TIMEOUT;
                }
                else
                {
                    if (NULL != mdmReplySearch(_MdmBuffer, "OK")){
                        RetSts =  _E8266_TCP_CONNECT_SRVR_SUCCESS;
                    }
                    else{
                        RetSts =  _E8266_TCP_CONNECT_SRVR_INVALID_STATE;
                        SendDataToUCA3("mdmReplySearch failed to find CONNECT OK");
                    }
                }
                RetryTimeout1--;

            } while ((RetryTimeout1 >0)&&(RetSts != _E8266_TCP_CONNECT_SRVR_SUCCESS));


            break;




        case _Esp__repeated_send_Request:
            SendDataToUCA3("__case _Esp__repeated_send_Request in MdmMakeReady__\r");
//            runHomeDisplay(_UpdateTxDataTransaction);
            RetSts = currState;
            if((RetSts == _E8266_CIPSTART_ALREADY_CONNCTD)||(RetSts == _E8266_CIPSTART_UDP_OK)||(RetSts == _E8266_CIPSTART_OK)||(RetSts == _E8266_SEND_OK_RECVD)||(RetSts == _E8266_SEND_TIMEOUT))
            {
                 RetryTimeout1 = 5;
                 do
                 {
                     SendDataToESP("AT+CIPSEND="); // station mode set
                     /*
                      * Check if UDP or TCP needed
                      * Send length accordingly
                      */
                     if(_udpDataLen > 0)
                     {
                         if((_udpDataLen >=1000)&&(_udpDataLen <2048))
                         {
                             SendCharToESP(_udpDataLen/1000 + 48);
                             SendCharToESP((_udpDataLen%1000)/100 + 48);
                             SendCharToESP((_udpDataLen%100)/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else if(_udpDataLen >=100)
                         {
                             SendCharToESP(_udpDataLen/100 + 48);
                             SendCharToESP((_udpDataLen%100)/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else if(_udpDataLen >=10)
                         {
                             SendCharToESP(_udpDataLen/10 + 48);
                             SendCharToESP(_udpDataLen%10 + 48);
                         }
                         else // < 10
                         {
                             SendCharToESP(_udpDataLen%10 + 48);
                         }

                     }
                     else //  for TCP
                     {
                         if(strlen((const char*)_getUrlPtr) >=100)
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)/100 + 48);
                             SendCharToESP((strlen((const char*)_getUrlPtr)%100)/10 + 48);
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                         else if(strlen((const char*)_getUrlPtr) >=10)
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)/10 + 48);
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                         else
                         {
                             SendCharToESP(strlen((const char*)_getUrlPtr)%10 + 48);
                         }
                     }
                     SendDataToESP("\r\n");
                     res = NULL;
                     res = mdmReplySearch((const char *)_MdmBuffer, ">");
                     if(*res=='>')
                     {
                         RetSts = _E8266_CIPSEND_ARROW_SUCCESS;
                     }
                     else
                     {
                         // HANDLING TO BE DONE HERE
                     }


                     RetryTimeout1--;

                 } while((RetSts != _E8266_CIPSEND_ARROW_SUCCESS)&&(RetryTimeout1>0));

                 if (RetryTimeout1 == 0)
                 {
                     RetSts = _E8266_CIPSEND_ARROW_TIMEOUT;// => CONTINUE FROM HERE
                 }

                 //////////////// Next send the GET Request in HTTP1.1 format without Secured channel/////
                 if(RetSts == _E8266_CIPSEND_ARROW_SUCCESS)
                 {
                     RetryTimeout1 = 1; // Keep retry of sending the string to only once as under one connection attempt, sending
                                         // The api request or data twice is of no use
                         do
                         {
                             if(_udpDataLen > 0)
                             {
                                 for (udpDataCtr = 0; udpDataCtr < _udpDataLen; ++udpDataCtr)
                                 {
                                     SendCharToESP(_getUrlPtr[udpDataCtr]);
                                 }

                             }
                             else
                             {
                                  SendDataToESP((const char*)_getUrlPtr); // GET request sent to Server
                             }
                                     RetryTimeout5 = 0;
                                     do
                                     {
                                         RetryTimeout5++;
                                         _delay_cycles(SystemFreq*2);//Adjust this as per network latency

                                     } while((_MdmBuffCnt == 0)&&(RetryTimeout5 < 3));



                                     RetryTimeout2 = 20;
                                     do
                                     {
                                         _delay_cycles(SystemFreq);
                                         if(_udpDataLen > 0)
                                         {
                                          res = NULL;
                                          res = strstr((const char *)_MdmBuffer,"SEND OK");//OK was changed to CLOSED on 2 May 2020
                                          _delay_cycles(SystemFreq/5);
                                          if(*res == 'S') //O was changed to CLOSED on 2 May 2020
                                          {

                                              break;
                                          }
                                         }

                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"CLOSED");//OK was changed to CLOSED on 2 May 2020
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'C') //O was changed to CLOSED on 2 May 2020
                                         {

                                             break;
                                         }
                                         res = NULL;
                                         res = strstr((const char *)_MdmBuffer,"FAIL");
                                         _delay_cycles(SystemFreq/5);
                                         if(*res == 'F')
                                         {

                                             break;
                                         }

                                         RetryTimeout2--;
                                     } while ((res == NULL)&&(RetryTimeout2>0)); // Blocking Call

