turjasuzworld/esp01Drivers/TW_ESP8266_v4.c
}

/*
 * This part has been added in the v4
 * Handles the TCP Client functionality that can be used in TCP socket comms
 * @param  _state : Accepts the current state in which the ESP8266 module is currently in
 * @return the state in which the module remains after the creation of the client.
 *          This function can be called recursively. Requires Stack check in RT
 */
esp8266StateMachines    _createTcpClient(esp8266StateMachines _state, const char* TcpServerIPAddr,uint16_t port )
{
    volatile  esp8266StateMachines tempState = _state;

    switch (tempState) {
        case _E8266_SEND_OK_RECVD:
        case _E8266_PING_FAIL:
        case _E8266_PING_TIMEOUT:
            tempState = MdmMakeReady(_Esp_CreateandConnect_TCP_Client, tempState, NULL, (char*)TcpServerIPAddr, NULL, NULL, port, NULL);
            if(tempState !=_E8266_TCP_CONNECT_SRVR_SUCCESS){
                tempState = _E8266_TCP_CREATECLIENT_FAILED;
            }


            break;
        default:
            break;
    }

    return tempState;
}

/* NOT FOR UDP MODE !!!!
 * Complete tested routine to manage
 * connection, reconnection and server GET/SET access flow
 */
esp8266StateMachines    _provision_Connect_GETcall_ESP(esp8266StateMachines _state, bool getChkNeeded, char* _GET_URL, char* _SERVER_URL)
{
    volatile  esp8266StateMachines k = _state;
    static int _espPwrOnRetryTimeout=0;
//    k=_E8266_PWR_UP;

    if((k == _E8266_PWR_UP)||
            (k == _E8266_SEND_OK_RECVD)||
            (k == _E8266_PING_SUCCESS)||
            (k == _E8266_CIPSTART_OK)||
            (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
            (k == _E8266_CIPSTART_TIMEOUT)||
            (k == _E8266_SEND_FAIL)||
            (k == _E8266_SEND_TIMEOUT)||
            (k == _E8266_SM_CMD_ERROR))
    {
                if((k == _E8266_PWR_UP)||
                        (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
                        (k == _E8266_CIPSTART_TIMEOUT)||
                        (k == _E8266_SEND_TIMEOUT)||
                        (k == _E8266_SEND_FAIL))
                {
                        _espPwrOnRetryTimeout=0;
                        while((k != _E8266_PWR_UP_SUCCESS)&&(_espPwrOnRetryTimeout<5))
                        {
                            if((k == _E8266_PWR_UP)||
                                    (k == _E8266_PWR_UP_FAILURE)||
                                    (k == _E8266_CIPSEND_ARROW_TIMEOUT)||
                                    (k == _E8266_CIPSTART_TIMEOUT)||
                                    (k == _E8266_SEND_TIMEOUT)||
                                    (k == _E8266_SEND_FAIL))
                                {
                                    disESP8266();
                                    _delay_cycles(SystemFreq);
                                    enESP8266();
                                }
                            if(k == _E8266_PWR_UP)
                                {
                                    k = MdmMakeReady(_Esp_Full_Init, k,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                                }
                            else
                                {
                                    k = MdmMakeReady(_Esp_Full_Init, _E8266_PWR_UP,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);// IGNORING REST USE CASES OF k AS OF NOW
                                }
                            _espPwrOnRetryTimeout++;
                        }

                        if(_espPwrOnRetryTimeout == 5)
                        {
                              if(k == _E8266_PWR_UP_FAILURE)  k = MdmMakeReady(_Esp_Full_Init, _E8266_PWR_DN,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                              return k; // any unwanted states will be returned and server conn will be aborted!
                        }




                        //// ESP can't reach below location unless
                        //// _E8266_PWR_UP_SUCCESS is received
                        k = MdmMakeReady(_Esp_Connect_WIFI, k,NULL,NULL,NULL,NULL,_E8266_NON_UDP_MODE,0);
                        if((k == _E8266_PING_FAIL)||(k == _E8266_CWJAP_AP_NT_FND_3)||(k == _E8266_CWJAP_WRNG_PSWRD_2))
                        {
                            return k; // any unwanted states will be returned and server conn will be aborted!
                        }
                }
        /*
         *  This part is only required if
         *  there is GET response needed
         */
        if(getChkNeeded)
        {
            k = MdmMakeReady(_Esp_GET_Request, k,_GET_URL,(char*)_SERVER_URL,NULL,NULL,_E8266_NON_UDP_MODE,0);
            if(k == ((_E8266_CIPSTART_DNS_ERROR)||(_E8266_CIPSTART_ERROR)||(_E8266_CIPSTART_TIMEOUT)))
            {
                k=MdmMakeReady(_Esp_UDP_Close_Request, k, NULL, NULL, NULL, NULL, _E8266_NON_UDP_MODE, 0);
                WDTCTL |= 0x6A00;
            }
            else
            {
                k = MdmMakeReady(_Esp__repeated_send_Request, k,_GET_URL,(char*)_SERVER_URL,NULL,NULL,_E8266_NON_UDP_MODE,0);
            }
//            _delay_cycles(SystemFreq*5);
        }
        else
        {

        }

    }
    return k; // should return _E8266_PING_SUCCESS (if getChkNeeded == false) or _E8266_SEND_OK_RECVD (if getChkNeeded == true)
}


/*
 * This Fxn checks if the device is a virgin device. If it has never been connected
 * to any SSID then it has to go through the first config.
 *
 * @param:  ns - set the state for start up of module. Preferably keep it as _BRN_START if starting connection
 *
 * @param   wssid is the wifi ssid that needs to be hard coded if LCD is absent
 *
 * @param   wpswd  is the wifi password that needs to be hard coded if LCD is absent
 *
 * @param   wifiFailCntMax is the maximum number of retires needed before connectivity is given up
 *
 * @ret     returns the state, either
 *
 */
nStates                _genericProvisionAndConnectEsp01(nStates ns,const char * wssid,  const char * wpswd, const int wifiFailCntMax, bool getFuncChkReqd)
{
    volatile nStates nDeviceStates = _BRN_NON_INITIALIZED;
    volatile esp8266StateMachines    _noLCDModuleState = _UNKNOWN;
    nDeviceStates = ns;//_BRN_START;
    int _wifiConnFailureTimes = 0;
    //WriteTo24CxxEEPROMMultiBytes_InterruptMode(0xae, 64, (14*32), 32, "123456789012345678901234567890");// ==> only for debug, remove!!!
    _delay_cycles(SystemFreq);
    // restore or use default values for non-lcd versions !
    if(wssid == NULL) return _BRN_INVALID_WIFI_SSID;
    if(wpswd == NULL) return _BRN_INVALID_WIFI_PSWD;
    if(NULL == strcpy(WifiParams._wifiSSID, wssid)) return _BRN_UNABLE_TO_SET_WIFI_CREDS;
    if(NULL == strcpy(WifiParams._wifiPSWD, wpswd)) return _BRN_UNABLE_TO_SET_WIFI_CREDS;

    while(_wifiConnFailureTimes < wifiFailCntMax)
    {
        if(getFuncChkReqd)
        {
            _noLCDModuleState = _provision_Connect_GETcall_ESP(_E8266_PWR_UP,getFuncChkReqd,(char*)_MdmGETurl, (char*)_serverURL);
            _noLCDModuleState = _provision_Connect_GETcall_ESP(_noLCDModuleState,getFuncChkReqd,(char*)_MdmGETurl, (char*)_serverURL);
            if(_noLCDModuleState == _E8266_SEND_OK_RECVD)
            {
                // inform on LED / LCD that connection has happened WIFI_CN_LED_ON();
                _wifiConnFailureTimes = 100; // 100 > 10 just to ensure that the above while doesn't re-loop if connected
                nDeviceStates = _BRN_RDY_GET;
                SendDataToUCA3("__Wifi Connected successfully__\r\n");
            }
            else
            {
                // Since the wifi could not be connected in last step,
                //Forcefully make device a Virgin Device, so that
                //the SSID and PWD may be entered again by user

                _wifiConnFailureTimes++;
                SendDataToUCA3("__Wifi Connection failure, retrying... Number:\r\n");
                SendCharToUCA3((_wifiConnFailureTimes/10)+48);
                SendCharToUCA3((_wifiConnFailureTimes%10)+48);
                SendDataToUCA3("\r\n");
            }
        }
        else
        {
            _noLCDModuleState = _provision_Connect_GETcall_ESP(_E8266_PWR_UP,getFuncChkReqd,(char*)_MdmGETurl, (char*)_serverURL);
            _noLCDModuleState = _provision_Connect_GETcall_ESP(_noLCDModuleState,getFuncChkReqd,(char*)_MdmGETurl, (char*)_serverURL);
            if( _noLCDModuleState == _E8266_PING_SUCCESS)
            {
                // inform on LED / LCD that connection has happened WIFI_CN_LED_ON();
                _wifiConnFailureTimes = 100; // 100 > 10 just to ensure that the above while doesn't re-loop if connected
                nDeviceStates = _BRN_RDY;
                SendDataToUCA3("__Wifi Connected successfully without get service checking__\r\n");
            }
            else
            {
                // Since the wifi could not be connected in last step,
                //Forcefully make device a Virgin Device, so that
                //the SSID and PWD may be entered again by user

                _wifiConnFailureTimes++;
                SendDataToUCA3("__Wifi Connection failure, retrying... Number:\r\n");
                SendCharToUCA3((_wifiConnFailureTimes/10)+48);
                SendCharToUCA3((_wifiConnFailureTimes%10)+48);
                SendDataToUCA3("\r\n");
            }
        }

        _delay_cycles(SystemFreq); //just wait 1 sec before retrying!!
    }
    if(_wifiConnFailureTimes == wifiFailCntMax)
    {
        SendDataToUCA3("__Unable to connect to Wifi... FORCED VIRGIN CONVERSION !!__\r\n");
        nDeviceStates = _BRN_WIFI_CONNECT_RETRY_TIMEOUT_ERR;
        // ==> reseting management shud be handled else whr //WDTCTL = 0x6A00;       // As of now resets the device so that the device enters the virgin device loop to take the SSID & PWD
    }
return nDeviceStates;

}


/*
 * callback function to parse data received in UCAx Buffer
 */
void ParseCallback(void (*ptr)())
{
    (*ptr) (); // callback to A
}
///////////////////////////////////////////////////////////////////////////////////////////////////////////
/*
 *    Interrupt Vectors for the data acquired from modem
 */

#if defined(__TI_COMPILER_VERSION__) || defined(__IAR_SYSTEMS_ICC__)
#pragma vector=USCI_A2_VECTOR
__interrupt void USCI_A2_ISR(void)
#elif defined(__GNUC__)
void __attribute__ ((interrupt(USCI_A2_VECTOR))) USCI_A2_ISR (void)
#else
#error Compiler not supported!
#endif
{
  switch(__even_in_range(UCA2IV,4))
  {
  case 0:

    break;                             // Vector 0 - no interrupt log_data

  case 2:                                   // Vector 2 - RXIFG
      _MdmBuffer[_MdmBuffCnt] = UCA2RXBUF;                  // TX -> RXed character
      SendCharToUCA3(_MdmBuffer[_MdmBuffCnt]);              // comment if usb terminal logging is not needed
      _MdmBuffCnt++;
      _bytesDataTransacted++;
      if(_MdmBuffCnt==1024) _MdmBuffCnt=0; // Added on 2 May 2020
    break;

  case 4:

    break;                             // Vector 4 - TXIFG

  default:

    break;
  }

//  __bic_SR_register_on_exit(LPM0_bits);     // exit power save mode if super loop is required in main
}
